---
kind: method
id: M:Autodesk.Revit.DB.PaperSizeSet.ForwardIterator
source: html/4fea9209-1bdd-4cb6-36ee-1a619671b82e.htm
---
# Autodesk.Revit.DB.PaperSizeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual PaperSizeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.